<template>
  <div class="admin_profile_receipt_conta">
    <!-- Search bar -->
    <subform
      class="code"
      name="جستجوی کد پیگیری"
      input__type="email"
      input__class="long__input ltr__input"
      label__class="long__label"
      input__placeholder="...کد پیگیری را برای جستجو وارد کنید "
    />

    <receipt-table :columns="columns" :rows="rows" />
  </div>
</template>

<script>
import ReceiptTable from "./ReceiptTable.vue";
import Subform from "./Subform.vue";

export default {
  name: "AdminProfileReceipt",
  components: {
    ReceiptTable,
    Subform,
  },
  data() {
    return {
      columns: [
        "کد پیگیری",
        "کالا",
        "قیمت پرداخت شده",
        "نام خریدار",
        "آدرس ارسال شده",
      ],
      rows: [
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102031",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102032",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102033",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102034",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102032",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102033",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "نام خریدار": "هادی",
          "کد پیگیری": "SHOP102034",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
      ],
    };
  },
};
</script>

<style scoped>
.admin_profile_receipt_conta {
  display: flex;
  flex-direction: column;
  align-items: center;
  gap: 50px;
}
</style>
