<template>
  <ReceiptTable :columns="columns" :rows="rows" />
</template>

<script>
import ReceiptTable from "./ReceiptTable.vue"

export default {
  name: "App",
  components: {
    ReceiptTable,
  },
  data() {
    return {
      columns: ["کد پیگیری", "کالا", "قیمت پرداخت شده", "آدرس ارسال شده"],
      rows: [
        {
          "کد پیگیری": "SHOP102030",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "کد پیگیری": "SHOP102030",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },

        {
          "کد پیگیری": "SHOP102030",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
        {
          "کد پیگیری": "SHOP102030",
          کالا: "موس گیمینگ ریز",
          "قیمت پرداخت شده": "10/000",
          "آدرس ارسال شده": "تهران، تهران، امیرکبیر",
        },
      ],
    };
  },
};
</script>
